---
kind: other
id: Methods.T:Autodesk.Revit.DB.CurveByPoints
source: html/37e813d4-87e1-fff6-ec4f-e5f12368c574.htm
---
# CurveByPoints Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.